// Ярушин Нач
#Область ПрограммныйИнтерфейс
// Дополнить форму.
// Добавляет в документы поле "Контактное лицо"
// Параметры:
// Форма - ДокументСсылка - Форма документа
//
Процедура ДополнитьФорму(Форма)Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма); 
//		ДобавитьПолеСогласованнаяСкидкаИКнопкаВГруппаШапкаЛево(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоВФормуПередСуммаДокумента(Форма);	
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоВФормуПередСуммаДокумента(Форма);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)
	
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо",Тип("ПолеФормы"),Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Ярушин_КонтактноеЛицо"; 
	
КонецПроцедуры

Процедура ВставитьПолеКонтактноеЛицоВФормуПередСуммаДокумента(Форма)
	
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо",Тип("ПолеФормы"),,Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Ярушин_КонтактноеЛицо";
	
КонецПроцедуры 

//Процедура ДобавитьПолеСогласованнаяСкидкаИКнопкаВГруппаШапкаЛево(Форма)
//	
//	СкидкаИКнопка = Форма.Элементы.Добавить("ГруппаСкидкаИКнопка",Тип("ГруппаФормы"),Форма.Элементы.ГруппаШапкаЛево);
//	СкидкаИКнопка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
//	СкидкаИКнопка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
//	
//	ПолеВвода = Форма.Элементы.Добавить("СогласованнаяСкидка",Тип("ПолеФормы"),СкидкаИКнопка);
//	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
//	ПолеВвода.ПутьКДанным = "Объект.Ярушин_СогласованнаяСкидка";
//	ПолеВвода.УстановитьДействие("ПриИзменении","Ярушин_СогласованнаяСкидкаПриИзменении");
//	
//	Команда = Форма.Команды.Добавить("ПрименитьСкидку");
//	Команда.Заголовок = "Применить скидку";
//	Команда.Действие = "ПрименитьСкидку";
//	
//	КомандаФормы = Форма.Элементы.Добавить("КнопкаПрименитьСкидку",Тип("КнопкаФормы"),СкидкаИКнопка);
//	КомандаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
//	КомандаФормы.ИмяКоманды = "ПрименитьСкидку";
//	
//КонецПроцедуры

#КонецОбласти
// Ярушин Кон